app/controllers/ideas_controller.rb

  def showAll
    # These are instance variables, which can be used in the views
    # This is how we display all the Idea(s) in the index view
  	@all_ideas = Idea.all.page(params[:page]).per(12)
---
SELECT  "ideas".* FROM "ideas" LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM "ideas"

  def add
    # THIS CANT BE RIGHT...
  	@idea = Idea.create(
      :name => params[:idea][:name],
      :author => current_user.profileName,
      :valueProposition => params[:idea][:valueProposition],
      :customerSegment => params[:idea][:customerSegment],
      :marketSize => params[:idea][:marketSize],
      :resources => params[:idea][:resources],
      :stage => params[:idea][:stage],
      :vision => params[:idea][:vision],
      :sector => params[:idea][:sector],
      :description => params[:idea][:description],
      :picture =>params[:idea][:picture]
    )

    if @idea.save
      current_user.createActivity(@idea, "created")
---
INSERT INTO "ideas" ("name", "author", "valueProposition", "customerSegment", "vision", "sector", "description", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "activities" ("user_id", "targetable_id", "targetable_type", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["targetable_id", 1], ["targetable_type", "Idea"], ["action", "created"], ["created_at", "2016-04-14 05:25:12.476883"], ["updated_at", "2016-04-14 05:25:12.476883"]]